src/main/resources/soap/downloadTransactions.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <DownloadTransactionFile xmlns="http://www.eClaimLink.ae/">
            <login>Ajay</login>
            <pwd>rohini</pwd>
            <fileId>{file}</fileId>
        </DownloadTransactionFile>
    </soap:Body>
</soap:Envelope>
